===
Decimal (integer, unsigned)
===

ident 123

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Decimal (integer, signed)
===

ident -123

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Decimal (real, unsigned)
===

ident 3.14159

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Decimal (real, signed)
===

ident +3.14159

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Decimal (real, unsigned, with unsigned exponent)
===

ident 6.02e23

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Decimal (real, signed, with signed exponent)
===

ident +6.02e+23

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (decimal)))))

===
Hexadecimal (unsigned)
===

ident 0xdeadBEEF

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (hexadecimal)))))

===
Hexadecimal (signed)
===

ident -0xBADf00d

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (hexadecimal)))))

===
Octal (unsigned)
===

ident 0o01234567

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (octal)))))

===
Octal (signed)
===

ident -0o76543210

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (octal)))))

===
Binary (unsigned)
===

ident 0b11110010

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (binary)))))

===
Binary (signed)
===

ident -0b10010110

---

(source_file
  (node
    (identifier (bare_identifier))
    (value (number (binary)))))
